## Problem statement
## Prepare a classification model using SVM for salary data

In [1]:
#load libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
#load data sets
df_test = pd.read_csv("D:\\ExcelR\\Assignments\\Downloaded\\SVM\\SalaryData_Test(1).csv")
df_train = pd.read_csv("D:\\ExcelR\\Assignments\\Downloaded\\SVM\\SalaryData_Train(1).csv")

In [3]:
df_train.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
df_test.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,25,Private,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,34,Private,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K

In [5]:
df_test['Salary'] = df_test['Salary'].map({' <=50K':1,' >50K':0})
df_train['Salary'] = df_train['Salary'].map({' <=50K':1,' >50K':0})
df_test.head(10)

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,25,Private,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,1
1,38,Private,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,1
2,28,Local-gov,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,0
3,44,Private,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,0
4,34,Private,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,1
5,63,Self-emp-not-inc,Prof-school,15,Married-civ-spouse,Prof-specialty,Husband,White,Male,3103,0,32,United-States,0
6,24,Private,Some-college,10,Never-married,Other-service,Unmarried,White,Female,0,0,40,United-States,1
7,55,Private,7th-8th,4,Married-civ-spouse,Craft-repair,Husband,White,Male,0,0,10,United-States,1
8,65,Private,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,6418,0,40,United-States,0
9,36,Federal-gov,Bachelors,13,Married-civ-spouse,Adm-clerical,Husband,White,Male,0,0,40,United-States,1

In [6]:
X = df_train.drop(['workclass','education','relationship','occupation','native','maritalstatus','sex','race'],axis=1)
Y = df_train['Salary']
print(np.unique(Y))
X.head()

[0 1]

   age  educationno  capitalgain  capitalloss  hoursperweek  Salary
0   39           13         2174            0            40       1
1   50           13            0            0            13       1
2   38            9            0            0            40       1
3   53            7            0            0            40       1
4   28           13            0            0            40       1

# Feature Selection and Encoding

In [7]:
from sklearn.svm import SVR
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split #training and testing data split

In [8]:
df_train = df_train.apply(LabelEncoder().fit_transform)
df_train.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,22,5,9,12,4,0,1,4,1,24,0,39,37,1
1,33,4,9,12,2,3,0,4,1,0,0,12,37,1
2,21,2,11,8,0,5,1,4,1,0,0,39,37,1
3,36,2,1,6,2,5,0,2,1,0,0,39,37,1
4,11,2,9,12,2,9,5,2,0,0,0,39,4,1

In [9]:
df_test = df_test.apply(LabelEncoder().fit_transform)
df_test.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,8,2,1,6,4,6,3,2,1,0,0,39,37,1
1,21,2,11,8,2,4,0,4,1,0,0,49,37,1
2,11,1,7,11,2,10,0,4,1,0,0,39,37,0
3,27,2,15,9,2,6,0,2,1,87,0,39,37,0
4,17,2,0,5,4,7,1,4,1,0,0,29,37,1

In [10]:
x = df_train.drop(['workclass','education','relationship','occupation','native','maritalstatus','sex','race'],axis=1)
y = df_train['Salary']
x.head()

   age  educationno  capitalgain  capitalloss  hoursperweek  Salary
0   22           12           24            0            39       1
1   33           12            0            0            12       1
2   21            8            0            0            39       1
3   36            6            0            0            39       1
4   11           12            0            0            39       1

In [11]:
X = df_test.drop(['workclass','education','relationship','occupation','native','maritalstatus','sex','race'],axis=1)
Y = df_test['Salary']
X.head()

   age  educationno  capitalgain  capitalloss  hoursperweek  Salary
0    8            6            0            0            39       1
1   21            8            0            0            49       1
2   11           11            0            0            39       0
3   27            9           87            0            39       0
4   17            5            0            0            29       1

In [12]:
#splitdata train test 80/20

In [13]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.2, random_state=3)

In [14]:
# Linear Support Vector Machine
from sklearn.svm import SVC
svc = SVC(gamma=0.22)
svc.fit(X_train, Y_train)
#y_pred = logreg.predict(X_test)
score_svc = svc.score(X_test,Y_test)
print('The accuracy of SVC is', score_svc)

The accuracy of SVC is 0.9326029216467463

## As we can see the accuracy is 93% for model linear support vector machine

In [15]:
# Radical Support Vector Machine
from sklearn import svm #support vector Machine
svc_radical =svm.SVC(kernel='rbf',C=1,gamma=0.22)
svc_radical.fit(X_train,Y_train.values.ravel())
score_svc_radical = svc_radical.score(X_test,Y_test)
print('The accuracy of Radical SVC Model is', score_svc_radical)

The accuracy of Radical SVC Model is 0.9326029216467463

## Conclusion: Using radical support vector machine 93% which is similar to SVM